# Когда используется критерий Стьюдента, а когда Z –критерий?

if __name__ == '__main__':

    print('Если условия применимости параметрических тестов соблюдены,',
          'то в случае известной сигмы генеральной совокупности более',
          'предпочтителен Z- критерий, в противном случае - критерий',
          'Стьюдента t.\n \n',
          'Критерий Стьюдента используется в тестировании гипотез, когда известный средний значение или дисперсия неопределены или если выборка слишком мала. В таких случаях используется t-распределение Стьюдента, которое используется для оценки значимости различий между средними значениями двух групп.',
          'Z-критерий используется, когда известны среднее значение и дисперсия выборки, или когда выборка достаточно большая. Z-распределение используется для оценки значимости различий между средним значением выборки и заданным средним значением популяции.\n')